run/cylinderCooling/0/hT.unmapped
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      hT;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 -1 0 0 0];

internalField   nonuniform List<scalar> 
10657
(
-1.5052113e-11
-1.4627936
8.0855273e-12
-2.1515503e-21
-7.4343429e-17
0
2.0244608e-20
-4.7169706e-17
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
4225.4881
4225.5547
4225.6264
4225.7024
4225.783
4225.8688
4225.96
4226.0565
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
