run/cylinderCooling/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
5388
(
0.86903295
0.86917729
0.86935022
0.86955738
0.86980546
0.87010246
0.8704579
0.87088311
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1.158623;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
66
(
1.1367515
1.1370091
1.1375388
1.1383453
1.1394211
1.1407455
1.1422835
1.1439864
...
)
;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
0.86896724
0.86896724
0.86896724
0.86896724
0.86896724
0.86896724
0.86896724
0.86896724
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
